
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_virtual_network.app_network will be created
  + resource "azurerm_virtual_network" "app_network" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "app-network"
      + resource_group_name = "bj-grp"
      + subnet              = [
          + {
              + address_prefix = "10.0.1.0/24"
              + id             = (known after apply)
              + name           = "Subnet-A27"
              + security_group = ""
            },
          + {
              + address_prefix = "10.0.2.0/24"
              + id             = (known after apply)
              + name           = "Subnet-B27"
              + security_group = ""
            },
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @bjakym, Action: `pull_request`, Working Directory: `azure_virtual_network`, Workflow: `Azure Terraform Self-hosted`*
